cpuset_test/log_pgbench500to900kvant10sec.txt
postgres@dev-pg-postgresql-client:/$ date +%H-%M-%S && pgbench --host 10.40.2.22 -U root -c 500 -j 6 -T 600 -P 10 benchmark
17-27-59
pgbench (15.3)
starting vacuum...end.
progress: 10.0 s, 203.4 tps, lat 1646.321 ms stddev 1045.993, 0 failed
progress: 20.0 s, 231.8 tps, lat 2140.177 ms stddev 1454.995, 0 failed
progress: 30.0 s, 230.2 tps, lat 2113.013 ms stddev 1515.104, 0 failed
progress: 40.0 s, 169.4 tps, lat 2845.149 ms stddev 2124.634, 0 failed
progress: 50.0 s, 199.9 tps, lat 2357.310 ms stddev 2150.333, 0 failed
progress: 60.0 s, 141.5 tps, lat 3189.271 ms stddev 3213.040, 0 failed
progress: 70.0 s, 138.2 tps, lat 3828.157 ms stddev 3790.471, 0 failed
progress: 80.0 s, 177.9 tps, lat 2740.350 ms stddev 2957.032, 0 failed
progress: 90.0 s, 151.5 tps, lat 3073.888 ms stddev 3501.187, 0 failed
progress: 100.0 s, 113.6 tps, lat 4015.199 ms stddev 4187.648, 0 failed
progress: 110.0 s, 110.8 tps, lat 4232.351 ms stddev 4931.876, 0 failed
progress: 120.0 s, 117.6 tps, lat 4200.996 ms stddev 5270.812, 0 failed
progress: 130.0 s, 111.9 tps, lat 4743.992 ms stddev 6089.430, 0 failed
progress: 140.0 s, 162.8 tps, lat 3611.739 ms stddev 4814.043, 0 failed
progress: 150.0 s, 159.3 tps, lat 3171.115 ms stddev 3581.931, 0 failed
progress: 160.0 s, 138.9 tps, lat 3805.090 ms stddev 3624.023, 0 failed
progress: 170.0 s, 154.5 tps, lat 2874.208 ms stddev 2627.035, 0 failed
progress: 180.0 s, 138.2 tps, lat 3562.769 ms stddev 3789.941, 0 failed
progress: 190.0 s, 130.7 tps, lat 4042.913 ms stddev 4398.742, 0 failed
progress: 200.0 s, 188.4 tps, lat 2981.776 ms stddev 3301.053, 0 failed
progress: 210.0 s, 261.0 tps, lat 2095.570 ms stddev 1606.833, 0 failed
progress: 220.0 s, 175.5 tps, lat 2713.805 ms stddev 1906.512, 0 failed
progress: 230.0 s, 191.6 tps, lat 2348.377 ms stddev 1588.533, 0 failed
progress: 240.0 s, 167.1 tps, lat 2774.678 ms stddev 2974.449, 0 failed
progress: 250.0 s, 167.1 tps, lat 3128.986 ms stddev 3483.475, 0 failed
progress: 260.0 s, 182.3 tps, lat 2811.229 ms stddev 2913.880, 0 failed
progress: 270.0 s, 175.2 tps, lat 2832.587 ms stddev 2718.514, 0 failed
progress: 280.0 s, 135.9 tps, lat 3624.018 ms stddev 3155.317, 0 failed
progress: 290.0 s, 166.9 tps, lat 2786.464 ms stddev 2859.571, 0 failed
progress: 300.0 s, 93.9 tps, lat 3966.913 ms stddev 3984.864, 0 failed
progress: 310.0 s, 96.5 tps, lat 5105.527 ms stddev 5950.134, 0 failed
progress: 320.0 s, 114.6 tps, lat 4757.532 ms stddev 5863.948, 0 failed
progress: 330.0 s, 152.9 tps, lat 4123.834 ms stddev 5198.976, 0 failed
progress: 340.0 s, 156.7 tps, lat 3272.314 ms stddev 2913.384, 0 failed
progress: 350.0 s, 193.6 tps, lat 2614.571 ms stddev 2328.081, 0 failed
progress: 360.0 s, 146.5 tps, lat 2898.340 ms stddev 3011.035, 0 failed
progress: 370.0 s, 141.0 tps, lat 3744.820 ms stddev 4073.262, 0 failed
progress: 380.0 s, 173.0 tps, lat 3017.748 ms stddev 3447.365, 0 failed
progress: 390.0 s, 204.8 tps, lat 2621.968 ms stddev 2600.607, 0 failed
progress: 400.0 s, 208.0 tps, lat 2607.991 ms stddev 2221.718, 0 failed
progress: 410.0 s, 286.2 tps, lat 1710.013 ms stddev 1145.993, 0 failed
progress: 420.0 s, 152.4 tps, lat 2757.586 ms stddev 2560.213, 0 failed
progress: 430.0 s, 170.5 tps, lat 3310.407 ms stddev 3281.168, 0 failed
progress: 440.0 s, 260.5 tps, lat 2067.429 ms stddev 1633.751, 0 failed
progress: 450.0 s, 271.6 tps, lat 1811.274 ms stddev 1187.434, 0 failed
progress: 460.0 s, 178.8 tps, lat 2592.247 ms stddev 1677.556, 0 failed
progress: 470.0 s, 220.8 tps, lat 2257.484 ms stddev 1581.969, 0 failed
progress: 480.0 s, 150.4 tps, lat 2578.475 ms stddev 2234.212, 0 failed
progress: 490.0 s, 160.0 tps, lat 3513.158 ms stddev 4013.550, 0 failed
progress: 500.0 s, 178.5 tps, lat 2913.759 ms stddev 3022.450, 0 failed
progress: 510.0 s, 195.7 tps, lat 2869.666 ms stddev 2623.930, 0 failed
progress: 520.0 s, 198.2 tps, lat 2472.723 ms stddev 1820.195, 0 failed
progress: 530.0 s, 247.2 tps, lat 2005.989 ms stddev 1530.529, 0 failed
progress: 540.0 s, 178.0 tps, lat 2386.982 ms stddev 2320.585, 0 failed
progress: 550.0 s, 150.0 tps, lat 3443.522 ms stddev 3359.708, 0 failed
progress: 560.0 s, 196.9 tps, lat 2524.594 ms stddev 2545.955, 0 failed
progress: 570.0 s, 156.6 tps, lat 3019.115 ms stddev 3079.716, 0 failed
progress: 580.0 s, 155.2 tps, lat 3001.782 ms stddev 3402.810, 0 failed
progress: 590.0 s, 126.2 tps, lat 3481.528 ms stddev 4081.191, 0 failed
progress: 600.0 s, 101.9 tps, lat 4315.396 ms stddev 5176.912, 0 failed
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 500
number of threads: 6
maximum number of tries: 1
duration: 600 s
number of transactions actually processed: 102602
number of failed transactions: 0 (0.000%)
latency average = 2929.654 ms
latency stddev = 3224.978 ms
initial connection time = 1836.604 ms
tps = 170.050961 (without initial connection time)
postgres@dev-pg-postgresql-client:/$ date +%H-%M-%S && pgbench --host 10.40.2.22 -U root -c 600 -j 6 -T 600 -P 10 benchmark
17-38-26
pgbench (15.3)
starting vacuum...end.
progress: 10.0 s, 147.5 tps, lat 2211.322 ms stddev 1642.322, 0 failed
progress: 20.0 s, 190.9 tps, lat 2748.248 ms stddev 2311.159, 0 failed
чёprogress: 30.0 s, 149.6 tps, lat 3467.607 ms stddev 3600.971, 0 failed
progress: 40.0 s, 131.7 tps, lat 4353.084 ms stddev 4641.738, 0 failed
progress: 50.0 s, 118.7 tps, lat 4432.037 ms stddev 4976.382, 0 failed
progress: 60.0 s, 121.4 tps, lat 5072.544 ms stddev 6323.556, 0 failed
progress: 70.0 s, 115.7 tps, lat 5075.000 ms stddev 6319.865, 0 failed
progress: 80.0 s, 124.8 tps, lat 4665.089 ms stddev 6099.347, 0 failed
progress: 90.0 s, 88.7 tps, lat 5493.264 ms stddev 6602.224, 0 failed
progress: 100.0 s, 71.1 tps, lat 7541.308 ms stddev 7830.849, 0 failed
progress: 110.0 s, 92.5 tps, lat 7377.255 ms stddev 8630.540, 0 failed
progress: 120.0 s, 97.1 tps, lat 6696.439 ms stddev 7582.929, 0 failed
progress: 130.0 s, 107.9 tps, lat 6001.809 ms stddev 8047.625, 0 failed
progress: 140.0 s, 111.5 tps, lat 5677.683 ms stddev 7070.631, 0 failed
progress: 150.0 s, 102.5 tps, lat 5096.049 ms stddev 6155.476, 0 failed
progress: 160.0 s, 73.8 tps, lat 6419.561 ms stddev 6462.291, 0 failed
progress: 170.0 s, 77.9 tps, lat 8052.018 ms stddev 9742.364, 0 failed
progress: 180.0 s, 93.3 tps, lat 7126.686 ms stddev 8568.163, 0 failed
progress: 190.0 s, 100.8 tps, lat 6875.804 ms stddev 8089.431, 0 failed
progress: 200.0 s, 117.8 tps, lat 5423.134 ms stddev 6783.631, 0 failed
progress: 210.0 s, 99.9 tps, lat 5566.047 ms stddev 6267.734, 0 failed
progress: 220.0 s, 85.5 tps, lat 6435.750 ms stddev 6471.931, 0 failed
progress: 230.0 s, 112.3 tps, lat 6149.173 ms stddev 6915.673, 0 failed
progress: 240.0 s, 142.0 tps, lat 4931.725 ms stddev 5665.093, 0 failed
progress: 250.0 s, 131.4 tps, lat 4431.089 ms stddev 4566.994, 0 failed
progress: 260.0 s, 133.2 tps, lat 4137.285 ms stddev 4208.899, 0 failed
progress: 270.0 s, 80.2 tps, lat 5789.663 ms stddev 5865.421, 0 failed
progress: 280.0 s, 69.5 tps, lat 7267.107 ms stddev 6916.902, 0 failed
progress: 290.0 s, 89.8 tps, lat 7701.185 ms stddev 8316.725, 0 failed
progress: 300.0 s, 93.7 tps, lat 6318.740 ms stddev 7367.676, 0 failed
progress: 310.0 s, 86.7 tps, lat 6938.117 ms stddev 8384.725, 0 failed
progress: 320.0 s, 114.9 tps, lat 6289.157 ms stddev 7648.340, 0 failed
progress: 330.0 s, 126.2 tps, lat 4529.360 ms stddev 5812.091, 0 failed
progress: 340.0 s, 93.6 tps, lat 5459.159 ms stddev 5399.085, 0 failed
progress: 350.0 s, 108.1 tps, lat 6086.900 ms stddev 7061.035, 0 failed
progress: 360.0 s, 118.7 tps, lat 5149.056 ms stddev 6394.182, 0 failed
progress: 370.0 s, 93.4 tps, lat 5379.194 ms stddev 6819.358, 0 failed
progress: 380.0 s, 116.7 tps, lat 5657.471 ms stddev 7058.104, 0 failed
progress: 390.0 s, 93.1 tps, lat 5991.886 ms stddev 7199.789, 0 failed
progress: 400.0 s, 77.3 tps, lat 6610.974 ms stddev 7329.267, 0 failed
progress: 410.0 s, 79.0 tps, lat 8333.884 ms stddev 9120.349, 0 failed
progress: 420.0 s, 79.6 tps, lat 7808.162 ms stddev 8614.464, 0 failed
progress: 430.0 s, 87.1 tps, lat 7175.161 ms stddev 8300.757, 0 failed
progress: 440.0 s, 113.5 tps, lat 6156.449 ms stddev 7066.692, 0 failed
progress: 450.0 s, 94.5 tps, lat 5586.260 ms stddev 6474.694, 0 failed
progress: 460.0 s, 75.9 tps, lat 7269.200 ms stddev 7279.034, 0 failed
progress: 470.0 s, 101.8 tps, lat 6913.053 ms stddev 7440.956, 0 failed
progress: 480.0 s, 124.5 tps, lat 5032.081 ms stddev 6548.398, 0 failed
progress: 490.0 s, 89.3 tps, lat 5325.142 ms stddev 5529.405, 0 failed
progress: 500.0 s, 112.6 tps, lat 5962.405 ms stddev 7262.202, 0 failed
progress: 510.0 s, 93.9 tps, lat 5619.226 ms stddev 6938.178, 0 failed
progress: 520.0 s, 83.4 tps, lat 6734.373 ms stddev 7366.820, 0 failed
progress: 530.0 s, 103.2 tps, lat 6513.581 ms stddev 7707.755, 0 failed
progress: 540.0 s, 103.9 tps, lat 5903.584 ms stddev 7613.736, 0 failed
progress: 550.0 s, 106.0 tps, lat 6105.293 ms stddev 7041.203, 0 failed
progress: 560.0 s, 102.2 tps, lat 6019.472 ms stddev 6845.594, 0 failed
progress: 570.0 s, 102.0 tps, lat 5025.965 ms stddev 6168.274, 0 failed
progress: 580.0 s, 89.3 tps, lat 6654.550 ms stddev 7402.381, 0 failed
progress: 590.0 s, 95.5 tps, lat 6984.161 ms stddev 7572.030, 0 failed
progress: 600.0 s, 125.5 tps, lat 5037.662 ms stddev 6344.393, 0 failed
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 600
number of threads: 6
maximum number of tries: 1
duration: 600 s
number of transactions actually processed: 63241
number of failed transactions: 0 (0.000%)
latency average = 5692.523 ms
latency stddev = 6832.169 ms
initial connection time = 2233.787 ms
tps = 105.088356 (without initial connection time)
postgres@dev-pg-postgresql-client:/$ date +%H-%M-%S && pgbench --host 10.40.2.22 -U root -c 700 -j 6 -T 600 -P 10 benchmark
17-50-47
pgbench (15.3)
starting vacuum...end.
progress: 10.0 s, 141.9 tps, lat 2256.640 ms stddev 1513.366, 0 failed
progress: 20.0 s, 162.2 tps, lat 3847.246 ms stddev 3123.935, 0 failed
progress: 30.0 s, 148.4 tps, lat 4300.474 ms stddev 4120.269, 0 failed
progress: 40.0 s, 133.6 tps, lat 4722.022 ms stddev 4621.177, 0 failed
progress: 50.0 s, 112.1 tps, lat 5636.072 ms stddev 5690.502, 0 failed
progress: 60.0 s, 123.2 tps, lat 5672.562 ms stddev 6155.698, 0 failed
progress: 70.0 s, 89.4 tps, lat 6314.019 ms stddev 6662.995, 0 failed
progress: 80.0 s, 65.6 tps, lat 8735.200 ms stddev 7806.831, 0 failed
progress: 90.0 s, 71.4 tps, lat 9024.326 ms stddev 9290.475, 0 failed
progress: 100.0 s, 97.1 tps, lat 8615.241 ms stddev 10371.090, 0 failed
progress: 110.0 s, 84.2 tps, lat 7592.776 ms stddev 8655.690, 0 failed
progress: 120.0 s, 83.1 tps, lat 7957.371 ms stddev 9671.758, 0 failed
progress: 130.0 s, 91.8 tps, lat 7790.618 ms stddev 9853.077, 0 failed
progress: 140.0 s, 94.1 tps, lat 7242.319 ms stddev 10449.531, 0 failed
progress: 150.0 s, 112.0 tps, lat 7109.318 ms stddev 10276.737, 0 failed
progress: 160.0 s, 103.6 tps, lat 7134.067 ms stddev 9825.686, 0 failed
progress: 170.0 s, 89.7 tps, lat 6989.174 ms stddev 8529.473, 0 failed
progress: 180.0 s, 87.0 tps, lat 7426.670 ms stddev 9313.802, 0 failed
progress: 190.0 s, 70.9 tps, lat 8486.878 ms stddev 10103.050, 0 failed
progress: 200.0 s, 57.8 tps, lat 10033.439 ms stddev 10869.132, 0 failed
progress: 210.0 s, 59.9 tps, lat 11708.348 ms stddev 12777.731, 0 failed
progress: 220.0 s, 57.0 tps, lat 12448.041 ms stddev 14197.904, 0 failed
progress: 230.0 s, 50.2 tps, lat 12696.891 ms stddev 13769.796, 0 failed
progress: 240.0 s, 67.0 tps, lat 12605.198 ms stddev 13997.823, 0 failed
progress: 250.0 s, 68.6 tps, lat 10789.033 ms stddev 12517.492, 0 failed
progress: 260.0 s, 69.8 tps, lat 10246.583 ms stddev 12362.823, 0 failed
progress: 270.0 s, 80.0 tps, lat 10094.765 ms stddev 12327.943, 0 failed
progress: 280.0 s, 108.8 tps, lat 8210.364 ms stddev 10253.118, 0 failed
progress: 290.0 s, 93.2 tps, lat 7204.871 ms stddev 7858.915, 0 failed
progress: 300.0 s, 104.1 tps, lat 6991.689 ms stddev 8338.098, 0 failed
progress: 310.0 s, 97.0 tps, lat 6577.202 ms stddev 7592.514, 0 failed
progress: 320.0 s, 93.1 tps, lat 7386.069 ms stddev 8135.275, 0 failed
progress: 330.0 s, 111.6 tps, lat 6848.915 ms stddev 8230.668, 0 failed
progress: 340.0 s, 119.3 tps, lat 6135.242 ms stddev 7749.535, 0 failed
progress: 350.0 s, 106.4 tps, lat 6157.908 ms stddev 6904.178, 0 failed
progress: 360.0 s, 102.8 tps, lat 6248.718 ms stddev 7679.606, 0 failed
progress: 370.0 s, 75.8 tps, lat 7266.848 ms stddev 8548.765, 0 failed
progress: 380.0 s, 59.4 tps, lat 10489.512 ms stddev 9494.449, 0 failed
progress: 390.0 s, 68.0 tps, lat 10318.701 ms stddev 11449.161, 0 failed
progress: 400.0 s, 76.7 tps, lat 9245.452 ms stddev 10509.187, 0 failed
progress: 410.0 s, 79.1 tps, lat 9735.097 ms stddev 11513.386, 0 failed
progress: 420.0 s, 89.7 tps, lat 8645.858 ms stddev 10781.712, 0 failed
progress: 430.0 s, 73.3 tps, lat 8006.235 ms stddev 9206.651, 0 failed
progress: 440.0 s, 63.3 tps, lat 9433.994 ms stddev 10537.964, 0 failed
progress: 450.0 s, 64.2 tps, lat 10269.623 ms stddev 11908.920, 0 failed
progress: 460.0 s, 67.3 tps, lat 10474.287 ms stddev 12014.497, 0 failed
progress: 470.0 s, 63.0 tps, lat 9770.331 ms stddev 11812.148, 0 failed
progress: 480.0 s, 63.0 tps, lat 11005.459 ms stddev 13221.757, 0 failed
progress: 490.0 s, 59.7 tps, lat 10461.711 ms stddev 12845.625, 0 failed
progress: 500.0 s, 56.0 tps, lat 10926.154 ms stddev 13507.670, 0 failed
progress: 510.0 s, 57.8 tps, lat 12578.743 ms stddev 15247.986, 0 failed
progress: 520.0 s, 57.0 tps, lat 12250.967 ms stddev 14996.587, 0 failed
progress: 530.0 s, 69.9 tps, lat 11788.755 ms stddev 15891.969, 0 failed
progress: 540.0 s, 94.0 tps, lat 8876.193 ms stddev 13434.426, 0 failed
progress: 550.0 s, 70.9 tps, lat 8954.049 ms stddev 12888.724, 0 failed
progress: 560.0 s, 49.9 tps, lat 9982.374 ms stddev 10418.374, 0 failed
progress: 570.0 s, 65.4 tps, lat 11454.438 ms stddev 13232.687, 0 failed
progress: 580.0 s, 74.6 tps, lat 9608.378 ms stddev 14492.154, 0 failed
progress: 590.0 s, 70.2 tps, lat 10579.706 ms stddev 15886.442, 0 failed
progress: 600.0 s, 67.3 tps, lat 10028.900 ms stddev 16366.493, 0 failed
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 700
number of threads: 6
maximum number of tries: 1
duration: 600 s
number of transactions actually processed: 51134
number of failed transactions: 0 (0.000%)
latency average = 8233.254 ms
latency stddev = 10753.066 ms
initial connection time = 2615.124 ms
tps = 84.612283 (without initial connection time)
postgres@dev-pg-postgresql-client:/$